{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 37], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "s0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "s0"}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "batch_input_shape": [null, 10000, 30, 64], "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 30}, "inbound_nodes": [[["s0", 0, 0, {}]], [["lstm_1", 0, 0, {}]], [["lstm_1", 1, 0, {}]], [["lstm_1", 2, 0, {}]], [["lstm_1", 3, 0, {}]], [["lstm_1", 4, 0, {}]], [["lstm_1", 5, 0, {}]], [["lstm_1", 6, 0, {}]], [["lstm_1", 7, 0, {}]], [["lstm_1", 8, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 1, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 2, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 3, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 4, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 5, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 6, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 7, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 8, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 9, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 10, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]], [["concatenate_1", 6, 0, {}]], [["concatenate_1", 7, 0, {}]], [["concatenate_1", 8, 0, {}]], [["concatenate_1", 9, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]]]}, {"name": "attention_weights", "class_name": "Activation", "config": {"name": "attention_weights", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]], [["dense_2", 5, 0, {}]], [["dense_2", 6, 0, {}]], [["dense_2", 7, 0, {}]], [["dense_2", 8, 0, {}]], [["dense_2", 9, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["attention_weights", 0, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 1, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 2, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 3, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 4, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 5, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 6, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 7, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 8, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights", 9, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "c0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "c0"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["s0", 0, 0, {}], ["c0", 0, 0, {}]], [["dot_1", 1, 0, {}], ["lstm_1", 0, 0, {}], ["lstm_1", 0, 2, {}]], [["dot_1", 2, 0, {}], ["lstm_1", 1, 0, {}], ["lstm_1", 1, 2, {}]], [["dot_1", 3, 0, {}], ["lstm_1", 2, 0, {}], ["lstm_1", 2, 2, {}]], [["dot_1", 4, 0, {}], ["lstm_1", 3, 0, {}], ["lstm_1", 3, 2, {}]], [["dot_1", 5, 0, {}], ["lstm_1", 4, 0, {}], ["lstm_1", 4, 2, {}]], [["dot_1", 6, 0, {}], ["lstm_1", 5, 0, {}], ["lstm_1", 5, 2, {}]], [["dot_1", 7, 0, {}], ["lstm_1", 6, 0, {}], ["lstm_1", 6, 2, {}]], [["dot_1", 8, 0, {}], ["lstm_1", 7, 0, {}], ["lstm_1", 7, 2, {}]], [["dot_1", 9, 0, {}], ["lstm_1", 8, 0, {}], ["lstm_1", 8, 2, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]], [["lstm_1", 1, 0, {}]], [["lstm_1", 2, 0, {}]], [["lstm_1", 3, 0, {}]], [["lstm_1", 4, 0, {}]], [["lstm_1", 5, 0, {}]], [["lstm_1", 6, 0, {}]], [["lstm_1", 7, 0, {}]], [["lstm_1", 8, 0, {}]], [["lstm_1", 9, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["s0", 0, 0], ["c0", 0, 0]], "output_layers": [["dense_3", 0, 0], ["dense_3", 1, 0], ["dense_3", 2, 0], ["dense_3", 3, 0], ["dense_3", 4, 0], ["dense_3", 5, 0], ["dense_3", 6, 0], ["dense_3", 7, 0], ["dense_3", 8, 0], ["dense_3", 9, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}